config/cf/InformationRegisters/Трудозатраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Трудозатраты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>// то, что пользователь указал вручную (в секундах) рабочее время</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДанные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект трудозатрат</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТрудозатратыОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Для кого выполнены работы</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИнициаторЗадания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Кем выполнены работы</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальности</Name>
					<Comment>Уникальный идентификатор уникальности</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/Трудозатраты/Forms/ФормаМоиТрудозатраты/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийПользователь  = Пользователи.ТекущийПользователь();
	УстановитьПериод();
	Список.Параметры.УстановитьЗначениеПараметра("Исполнитель",   ТекущийПользователь);
	Период = Новый СтандартныйПериод(ВариантСтандартногоПериода.Сегодня);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьМоиТрудозатраты" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	УстановитьПериод();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;		
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Объект", 			 ТекущиеДанные.Объект); 
		СтруктураПараметров.Вставить("Исполнитель", 	 ТекущиеДанные.Исполнитель); 
		СтруктураПараметров.Вставить("Инициатор", 	 	 ТекущиеДанные.Инициатор); 
		СтруктураПараметров.Вставить("КлючУникальности", Новый УникальныйИдентификатор);
		СтруктураПараметров.Вставить("ДатаНачала", 		 ТекущиеДанные.ДатаНачала); 
		СтруктураПараметров.Вставить("ДатаОкончания", 	 ТекущиеДанные.ДатаОкончания); 
		СтруктураПараметров.Вставить("Длительность", 	 ТекущиеДанные.Длительность); 
		СтруктураПараметров.Вставить("ВидРаботы", 		 ТекущиеДанные.ВидРаботы); 
		СтруктураПараметров.Вставить("Описание", 		 ТекущиеДанные.Описание); 
		СтруктураПараметров.Вставить("Данные", 			 ТекущиеДанные.Данные); 
		СтруктураПараметров.Вставить("ВидФормы", 		 "ФормаНовойЗаписиКопирование");
		ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеДобавленияТрудозатрат", ЭтотОбъект);		
		ОткрытьФорму("РегистрСведений.Трудозатраты.Форма.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект,,,, 
            ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Отказ = Истина;
		Добавить(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Добавить(Команда)	
	
	ОписаниеОповещения  = Новый ОписаниеОповещения("ПослеДобавленияТрудозатрат", ЭтотОбъект);
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидФормы", "ФормаНовойЗаписиМоиТрудозатраты");
	ОткрытьФорму("РегистрСведений.Трудозатраты.Форма.ФормаЗаписи", СтруктураПараметров, ЭтотОбъект,,,,
        ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияТрудозатрат(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПериод()	
	
	МоментВремени 		 = ТекущаяДатаСеанса();
	Если Период.ДатаНачала = Дата(1, 1, 1) Тогда
		Период.ДатаНачала = НачалоДня(МоментВремени);
	КонецЕсли;
	Если Период.ДатаОкончания = Дата(1, 1, 1) Тогда
		Период.ДатаОкончания = КонецДня(МоментВремени);
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",    НачалоДня(Период.ДатаНачала)); 
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(Период.ДатаОкончания));
	
КонецПроцедуры

#КонецОбласти
